## 7.1 Introdução a árvores de decisão

- Inteligência artificial (IA se refere à simulação da inteligência humana em máquinas programadas para pensar como humanos e imitar suas ações)
    
    - Machine Learning (Técnica dentro de inteligência artificial, se refere ao conceito de que progrmas de computador podem aprender automaticamente e se adaptar a novos dados sem serem assistidos por humanos)
    
        -  Modelo Supervisionado (É uma abordagem de aprendizado de máquina definida pelo uso de conjuntos de dados com rótulos (target). Esses conjuntos de dados são projetados para treinar algoritimos para classificar dados ou prever resultados)
            
            - Classificação (São usados quando a variável resposta (target) é discreta, categorizado, com classes, exemplos: Classificar um email em spam ou não spam, classificar um cliente em bom ou mau pagador, classificar a qualidade de uma peça entre baixa, média, alta etc.)

            - Regressão (São usados quando a variável resposta (target) é um valor numérico continuo, exemplos: Previsão de vendas, previsão de receita, previsão de temperatura, preço de aluguel etc.)
        
        -  Modelo Não Supervisionado (É uma abordagem de aprendizado de maquina que usa algoritimos de aprendizado de máquina para analisar e agrupar conjuntos de dados não rotulados. Esses algoritimos descobrem padrões ocultos nos dados)

- Árvore de decisão (DT) é um método de aprendizado que usa regras de decisão simples inferidas a partir dos dados (Se aplica tanto no modelo de Classificação quanto no de Regressão)

## 7.2 Carregando e tratando os dados

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
# Carregando o dataframe
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Explorando dados e removendo dados duplicados

In [3]:
# titanic.dtypes
# titanic.isna().sum()

# informações sobre o dataframe contagem de linhas, contagem de variáveis não nulas tipos
# talvez uma melhor forma que o dtypes
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
titanic.shape

(891, 15)

In [5]:
t = titanic.drop_duplicates()
t.shape

(784, 15)

In [6]:
# t.tail()
t.reset_index(drop=True, inplace=True)

In [7]:
t.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
779,0,3,female,39.0,0,5,29.125,Q,Third,woman,False,NaN,Queenstown,no,False
780,1,1,female,19.0,0,0,30.000,S,First,woman,False,B,Southampton,yes,True
781,0,3,female,NaN,1,2,23.450,S,Third,woman,False,NaN,Southampton,no,False
782,1,1,male,26.0,0,0,30.000,C,First,man,True,C,Cherbourg,yes,True
783,0,3,male,32.0,0,0,7.750,Q,Third,man,True,NaN,Queenstown,no,True

### Identificando e tratando dados ausentes

In [8]:
# scikit-learn não suporta dados ausentes
t.isna().sum()

survived         0
pclass           0
sex              0
age            106
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           582
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
# percentual de dados ausentes
pctg = (t.isnull().sum() / len(t)) * 100
pctg

survived        0.000000
pclass          0.000000
sex             0.000000
age            13.520408
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.255102
class           0.000000
who             0.000000
adult_male      0.000000
deck           74.234694
embark_town     0.255102
alive           0.000000
alone           0.000000
dtype: float64

In [10]:
t.shape

(784, 15)

In [11]:
# dropando colunas que contem dados NA
t_nna = t.dropna(axis=1)
t_nna.head()

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True

In [12]:
t_nna.shape

(784, 11)

In [13]:
t_nna.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    784 non-null    int64
 1   pclass      784 non-null    int64
 2   sex         784 non-null    object
 3   sibsp       784 non-null    int64
 4   parch       784 non-null    int64
 5   fare        784 non-null    float64
 6   class       784 non-null    category
 7   who         784 non-null    object
 8   adult_male  784 non-null    bool
 9   alive       784 non-null    object
 10  alone       784 non-null    bool
dtypes: bool(2), category(1), float64(1), int64(4), object(3)
memory usage: 51.6+ KB

In [14]:
# comparando se seriam as mesmas variáveis
t_nna.survived.value_counts()

0    461
1    323
Name: survived, dtype: int64

In [15]:
t_nna.alive.value_counts()

no     461
yes    323
Name: alive, dtype: int64

In [16]:
# agrupando para verificar se seriam exatamente os mesmo valores nas duas colunas 
# 'alive', 'survived'
t_nna[['alive', 'survived', 'sibsp']].groupby(['alive', 'survived']).count()

                sibsp
alive survived
no    0           461
yes   1           323

In [17]:
# dropando variáveis iguais
t_nna2 = t_nna.drop('alive', axis=1)

In [18]:
# agrupando para verificar se seriam exatamente os mesmo valores nas duas colunas 
# 'pclass', 'class'
t_nna[['pclass', 'class', 'sibsp']].groupby(['pclass', 'class']).count()

               sibsp
pclass class
1      First     214
       Second      0
       Third       0
2      First       0
       Second    165
       Third       0
3      First       0
       Second      0
       Third     405

In [19]:
t_nna2 = t_nna2.drop('class', axis=1)

In [20]:
t_nna2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    784 non-null    int64
 1   pclass      784 non-null    int64
 2   sex         784 non-null    object
 3   sibsp       784 non-null    int64
 4   parch       784 non-null    int64
 5   fare        784 non-null    float64
 6   who         784 non-null    object
 7   adult_male  784 non-null    bool
 8   alone       784 non-null    bool
dtypes: bool(2), float64(1), int64(4), object(2)
memory usage: 44.5+ KB

In [21]:
# transformando variáveis objeto em [ flag ]
t_enc = pd.get_dummies(t_nna2, columns=['who'], drop_first=True)
t_enc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    784 non-null    int64
 1   pclass      784 non-null    int64
 2   sex         784 non-null    object
 3   sibsp       784 non-null    int64
 4   parch       784 non-null    int64
 5   fare        784 non-null    float64
 6   adult_male  784 non-null    bool
 7   alone       784 non-null    bool
 8   who_man     784 non-null    uint8
 9   who_woman   784 non-null    uint8
dtypes: bool(2), float64(1), int64(4), object(1), uint8(2)
memory usage: 39.9+ KB

In [22]:
t_enc.head(10)

,survived,pclass,sex,sibsp,parch,fare,adult_male,alone,who_man,who_woman
0,0,3,male,1,0,7.2500,True,False,1,0
1,1,1,female,1,0,71.2833,False,False,0,1
2,1,3,female,0,0,7.9250,False,True,0,1
3,1,1,female,1,0,53.1000,False,False,0,1
4,0,3,male,0,0,8.0500,True,True,1,0
5,0,3,male,0,0,8.4583,True,True,1,0
6,0,1,male,0,0,51.8625,True,True,1,0
7,0,3,male,3,1,21.0750,False,False,0,0
8,1,3,female,0,2,11.1333,False,False,0,1
9,1,2,female,1,0,30.0708,False,False,0,0

In [23]:
# tratando o sexo com o método map
t_enc.sex = t_enc.sex.map({'female': 1, 'male': 0})
t_enc.head(10)

,survived,pclass,sex,sibsp,parch,fare,adult_male,alone,who_man,who_woman
0,0,3,0,1,0,7.2500,True,False,1,0
1,1,1,1,1,0,71.2833,False,False,0,1
2,1,3,1,0,0,7.9250,False,True,0,1
3,1,1,1,1,0,53.1000,False,False,0,1
4,0,3,0,0,0,8.0500,True,True,1,0
5,0,3,0,0,0,8.4583,True,True,1,0
6,0,1,0,0,0,51.8625,True,True,1,0
7,0,3,0,3,1,21.0750,False,False,0,0
8,1,3,1,0,2,11.1333,False,False,0,1
9,1,2,1,1,0,30.0708,False,False,0,0

In [24]:
t_enc['sex'].unique()
t_enc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    784 non-null    int64
 1   pclass      784 non-null    int64
 2   sex         784 non-null    int64
 3   sibsp       784 non-null    int64
 4   parch       784 non-null    int64
 5   fare        784 non-null    float64
 6   adult_male  784 non-null    bool
 7   alone       784 non-null    bool
 8   who_man     784 non-null    uint8
 9   who_woman   784 non-null    uint8
dtypes: bool(2), float64(1), int64(5), uint8(2)
memory usage: 39.9 KB

In [25]:
# transformando variáveis booleanas em int
t_enc.adult_male = t_enc.adult_male.astype(int)
t_enc.alone = t_enc.alone.astype(int)
t_enc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    784 non-null    int64
 1   pclass      784 non-null    int64
 2   sex         784 non-null    int64
 3   sibsp       784 non-null    int64
 4   parch       784 non-null    int64
 5   fare        784 non-null    float64
 6   adult_male  784 non-null    int64
 7   alone       784 non-null    int64
 8   who_man     784 non-null    uint8
 9   who_woman   784 non-null    uint8
dtypes: float64(1), int64(7), uint8(2)
memory usage: 50.7 KB

In [26]:
t_enc.head()

,survived,pclass,sex,sibsp,parch,fare,adult_male,alone,who_man,who_woman
0,0,3,0,1,0,7.2500,1,0,1,0
1,1,1,1,1,0,71.2833,0,0,0,1
2,1,3,1,0,0,7.9250,0,1,0,1
3,1,1,1,1,0,53.1000,0,0,0,1
4,0,3,0,0,0,8.0500,1,1,1,0

### Dividindo o conjunto de dados para começar o treinamento do algorítimo

In [27]:
# selecionando somente a coluna de sobreviventes
y = t_enc.survived
y

0      0
1      1
2      1
3      1
4      0
      ..
779    0
780    1
781    0
782    1
783    0
Name: survived, Length: 784, dtype: int64

In [28]:
# dropando a coluna de sobreviventes
x = t_enc.drop('survived', axis=1)

In [29]:
x

     pclass  sex  sibsp  parch     fare  adult_male  alone  who_man  who_woman
0         3    0      1      0   7.2500           1      0        1          0
1         1    1      1      0  71.2833           0      0        0          1
2         3    1      0      0   7.9250           0      1        0          1
3         1    1      1      0  53.1000           0      0        0          1
4         3    0      0      0   8.0500           1      1        1          0
..      ...  ...    ...    ...      ...         ...    ...      ...        ...
779       3    1      0      5  29.1250           0      0        0          1
780       1    1      0      0  30.0000           0      1        0          1
781       3    1      1      2  23.4500           0      0        0          1
782       1    0      0      0  30.0000           1      1        1          0
783       3    0      0      0   7.7500           1      1        1          0

[784 rows x 9 columns]

## 7.3 Melhor valor e variável para quebra